package jp.kaleidot725.sample.ui.theme

val EmptyText = " "

val DemoText = """
Android（アンドロイド）は、Googleが開発した汎用モバイルオペレーティングシステムである[3][4][注釈 1]。Linuxカーネルやオープンソースソフトウェアがベースで、主にスマートフォンやタブレットなどのタッチスクリーンモバイルデバイス向けにデザインされている。PC用にはAndroid-x86、テレビ用にはAndroid TV、自動車用にはAndroid Auto、ウェアラブルデバイス用にはWear OS（旧称Android Wear）がある。世界で最もよく使われているオペレーティングシステムであり、2021年5月時点で30億台を超えるアクティブデバイスがある[7]。 iPhoneと区別する為に､Androidスマートフォンをさす呼称としても使われる[8]｡
2003年にアンディ・ルービン、リッチ ・マイナー、ニック・シアーズ、クリス・ホワイトがアメリカカリフォルニア州パロアルトに携帯電話向けソフトウェアプラットフォームを開発するAndroid社を設立した。2005年にGoogleがAndroid社を買収[9]し、一時はGoogleが「gPhone」という独自の携帯電話端末の開発を進めているという憶測が流れた[10]。2007年11月5日、携帯電話用ソフトウェアのプラットフォームであるAndroidを、Google[11][12][13]、米クアルコム、独通信キャリアのT-モバイル（T-Mobile International）などが中心となり設立した規格団体「Open Handset Alliance」（オープン・ハンドセット・アライアンス、OHA）が発表した。
無償で誰にでも提供されるオープンソース（オープンソースソフトウェア）であり[14]、サードパーティーのベンダーが独自にカスタマイズしやすくすることを目的として、Apache License 2.0に基づいて配布されている。2008年10月からは対応する携帯電話が多数販売されている。
競合するモバイル向けプラットフォームは、AppleのiOS/iPadOS/watchOS/tvOSがある。過去の競合にはマイクロソフトのWindows Mobile/Windows Phone/Windows 10 Mobile、アクセンチュアのSymbian OS、クアルコムのBrew MP、ブラックベリーのBlackBerry、Linux FoundationのTizenなどがあった。Googleはスマートフォン・タブレット・腕時計（スマートウォッチ）以外にもゲーム機・冷蔵庫といった領域にもAndroidを搭載させる考えである[15]。
Android OSを搭載するスマートフォンとタブレットはベンダー各社から発売されており、それぞれベンダー固有のブランド名が付けられている。これらはAndroidスマートフォンやAndroidタブレットというような総称で呼ばれる[16][17][18][19][20]。主な競合はiOSあるいはiPadOSを搭載するiPhoneおよびiPadである。
""".trimIndent()
